# Position Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertex..::..Position Property
SlabShapeVertex Class See Also
---
The position of the vertex.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Position { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Position As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Position {
	XYZ^ get ();
}
```

# See Also
SlabShapeVertex Class
Autodesk.Revit.DB Namespace